doc/2025_10_01-intercurrentEstimand/intercurrentEstimand.tex
% Created 2025-10-01 on 13:04
% Intended LaTeX compiler: pdflatex
\documentclass[12pt]{article}

%%%% settings when exporting code %%%% 

\usepackage{listings}
\lstdefinestyle{code-small}{
backgroundcolor=\color{white}, % background color for the code block
basicstyle=\ttfamily\small, % font used to display the code
commentstyle=\color[rgb]{0.5,0,0.5}, % color used to display comments in the code
keywordstyle=\color{black}, % color used to highlight certain words in the code
numberstyle=\ttfamily\tiny\color{gray}, % color used to display the line numbers
rulecolor=\color{black}, % color of the frame
stringstyle=\color[rgb]{0,.5,0},  % color used to display strings in the code
breakatwhitespace=false, % sets if automatic breaks should only happen at whitespace
breaklines=true, % sets automatic line breaking
columns=fullflexible,
frame=single, % adds a frame around the code (non,leftline,topline,bottomline,lines,single,shadowbox)
keepspaces=true, % % keeps spaces in text, useful for keeping indentation of code
literate={~}{$\sim$}{1}, % symbol properly display via latex
numbers=none, % where to put the line-numbers; possible values are (none, left, right)
numbersep=10pt, % how far the line-numbers are from the code
showspaces=false,
showstringspaces=false,
stepnumber=1, % the step between two line-numbers. If it's 1, each line will be numbered
tabsize=1,
xleftmargin=0cm,
emph={anova,apply,class,coef,colnames,colNames,colSums,dim,dcast,for,ggplot,head,if,ifelse,is.na,lapply,list.files,library,logLik,melt,plot,require,rowSums,sapply,setcolorder,setkey,str,summary,tapply},
aboveskip = \medskipamount, % define the space above displayed listings.
belowskip = \medskipamount, % define the space above displayed listings.
lineskip = 0pt} % specifies additional space between lines in listings
\lstset{style=code-small}
%%%% packages %%%%%

\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{lmodern}
\usepackage{textcomp}
\usepackage{color}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{longtable}
\usepackage{multirow}
\usepackage{multicol}
\usepackage{changes}
\usepackage{pdflscape}
\usepackage{geometry}
\usepackage[normalem]{ulem}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage{amsfonts}
\usepackage{dsfont}
\usepackage{array}
\usepackage{ifthen}
\usepackage{hyperref}
\usepackage{natbib}
%
%%%% specifications %%%%
%
\usepackage{ifthen}
\usepackage{xifthen}
\usepackage{xargs}
\usepackage{xspace}
\RequirePackage{fancyvrb}
\DefineVerbatimEnvironment{verbatim}{Verbatim}{fontsize=\small,formatcom = {\color[rgb]{0.5,0,0}}}
\RequirePackage{colortbl} % arrayrulecolor to mix colors
\RequirePackage{setspace} % to modify the space between lines - incompatible with footnote in beamer
\renewcommand{\baselinestretch}{1.1}
\geometry{top=1cm, left=2cm, right=2cm}
\RequirePackage{colortbl} % arrayrulecolor to mix colors
\RequirePackage{pifont}
\RequirePackage{relsize}
\newcommand{\Cross}{{\raisebox{-0.5ex}%
{\relsize{1.5}\ding{56}}}\hspace{1pt} }
\newcommand{\Valid}{{\raisebox{-0.5ex}%
{\relsize{1.5}\ding{52}}}\hspace{1pt} }
\newcommand{\CrossR}{ \textcolor{red}{\Cross} }
\newcommand{\ValidV}{ \textcolor{green}{\Valid} }
\usepackage{stackengine}
\usepackage{scalerel}
\newcommand\Warning[1][3ex]{%
\renewcommand\stacktype{L}%
\scaleto{\stackon[1.3pt]{\color{red}$\triangle$}{\tiny\bfseries !}}{#1}%
\xspace
}
\hypersetup{
citecolor=[rgb]{0,0.5,0},
urlcolor=[rgb]{0,0,0.5},
linkcolor=[rgb]{0,0,0.5},
}
\RequirePackage{epstopdf} % to be able to convert .eps to .pdf image files
\RequirePackage{capt-of} %
\RequirePackage{caption} % newlines in graphics
\RequirePackage{tikz}
\RequirePackage{tikz-cd}
\definecolor{grayR}{HTML}{8A8990}
\definecolor{grayL}{HTML}{C4C7C9}
\definecolor{blueM}{HTML}{1F63B5}
\newcommand{\Rlogo}[1][0.07]{
\begin{tikzpicture}[scale=#1]
\shade [right color=grayR,left color=grayL,shading angle=60]
(-3.55,0.3) .. controls (-3.55,1.75)
and (-1.9,2.7) .. (0,2.7) .. controls (2.05,2.7)
and (3.5,1.6) .. (3.5,0.3) .. controls (3.5,-1.2)
and (1.55,-2) .. (0,-2) .. controls (-2.3,-2)
and (-3.55,-0.75) .. cycle;

\fill[white]
(-2.15,0.2) .. controls (-2.15,1.2)
and (-0.7,1.8) .. (0.5,1.8) .. controls (2.2,1.8)
and (3.1,1.2) .. (3.1,0.2) .. controls (3.1,-0.75)
and (2.4,-1.45) .. (0.5,-1.45) .. controls (-1.1,-1.45)
and (-2.15,-0.7) .. cycle;

\fill[blueM]
(1.75,1.25) -- (-0.65,1.25) -- (-0.65,-2.75) -- (0.55,-2.75) -- (0.55,-1.15) --
(0.95,-1.15)  .. controls (1.15,-1.15)
and (1.5,-1.9) .. (1.9,-2.75) -- (3.25,-2.75)  .. controls (2.2,-1)
and (2.5,-1.2) .. (1.8,-0.95) .. controls (2.6,-0.9)
and (2.85,-0.35) .. (2.85,0.2) .. controls (2.85,0.7)
and (2.5,1.2) .. cycle;

\fill[white]  (1.4,0.4) -- (0.55,0.4) -- (0.55,-0.3) -- (1.4,-0.3).. controls (1.75,-0.3)
and (1.75,0.4) .. cycle;

\end{tikzpicture}
}
\RequirePackage{enumitem} % to be able to convert .eps to .pdf image files
\definecolor{light}{rgb}{1, 1, 0.9}
\definecolor{lightred}{rgb}{1.0, 0.7, 0.7}
\definecolor{lightblue}{rgb}{0.0, 0.8, 0.8}
\newcommand{\darkblue}{blue!80!black}
\newcommand{\darkgreen}{green!50!black}
\newcommand{\darkred}{red!50!black}
\usepackage{mdframed}
\newcommand{\first}{1\textsuperscript{st} }
\newcommand{\second}{2\textsuperscript{nd} }
\newcommand{\third}{3\textsuperscript{rd} }
\RequirePackage{amsmath}
\RequirePackage{algorithm}
\RequirePackage[noend]{algpseudocode}
\RequirePackage{dsfont}
\RequirePackage{amsmath,stmaryrd,graphicx}
\RequirePackage{prodint} % product integral symbol (\PRODI)
\newcommand\defOperator[7]{%
\ifthenelse{\isempty{#2}}{
\ifthenelse{\isempty{#1}}{#7{#3}#4}{#7{#3}#4 \left#5 #1 \right#6}
}{
\ifthenelse{\isempty{#1}}{#7{#3}#4_{#2}}{#7{#3}#4_{#1}\left#5 #2 \right#6}
}
}
\newcommand\defUOperator[5]{%
\ifthenelse{\isempty{#1}}{
#5\left#3 #2 \right#4
}{
\ifthenelse{\isempty{#2}}{\underset{#1}{\operatornamewithlimits{#5}}}{
\underset{#1}{\operatornamewithlimits{#5}}\left#3 #2 \right#4}
}
}
\newcommand{\defBoldVar}[2]{
\ifthenelse{\equal{#2}{T}}{\boldsymbol{#1}}{\mathbf{#1}}
}
\newcommandx\Cov[2][1=,2=]{\defOperator{#1}{#2}{C}{ov}{\lbrack}{\rbrack}{\mathbb}}
\newcommandx\Esp[2][1=,2=]{\defOperator{#1}{#2}{E}{}{\lbrack}{\rbrack}{\mathbb}}
\newcommandx\Prob[2][1=,2=]{\defOperator{#1}{#2}{P}{}{\lbrack}{\rbrack}{\mathbb}}
\newcommandx\Qrob[2][1=,2=]{\defOperator{#1}{#2}{Q}{}{\lbrack}{\rbrack}{\mathbb}}
\newcommandx\Var[2][1=,2=]{\defOperator{#1}{#2}{V}{ar}{\lbrack}{\rbrack}{\mathbb}}
\newcommandx\Binom[2][1=,2=]{\defOperator{#1}{#2}{B}{}{(}{)}{\mathcal}}
\newcommandx\Gaus[2][1=,2=]{\defOperator{#1}{#2}{N}{}{(}{)}{\mathcal}}
\newcommandx\Wishart[2][1=,2=]{\defOperator{#1}{#2}{W}{ishart}{(}{)}{\mathcal}}
\newcommandx\Likelihood[2][1=,2=]{\defOperator{#1}{#2}{L}{}{(}{)}{\mathcal}}
\newcommandx\Information[2][1=,2=]{\defOperator{#1}{#2}{I}{}{(}{)}{\mathcal}}
\newcommandx\Score[2][1=,2=]{\defOperator{#1}{#2}{S}{}{(}{)}{\mathcal}}
\newcommandx\Vois[2][1=,2=]{\defOperator{#1}{#2}{V}{}{(}{)}{\mathcal}}
\newcommandx\IF[2][1=,2=]{\defOperator{#1}{#2}{IF}{}{(}{)}{\mathcal}}
\newcommandx\Ind[1][1=]{\defOperator{}{#1}{1}{}{(}{)}{\mathds}}
\newcommandx\Max[2][1=,2=]{\defUOperator{#1}{#2}{(}{)}{min}}
\newcommandx\Min[2][1=,2=]{\defUOperator{#1}{#2}{(}{)}{max}}
\newcommandx\argMax[2][1=,2=]{\defUOperator{#1}{#2}{(}{)}{argmax}}
\newcommandx\argMin[2][1=,2=]{\defUOperator{#1}{#2}{(}{)}{argmin}}
\newcommandx\cvD[2][1=D,2=n \rightarrow \infty]{\xrightarrow[#2]{#1}}
\newcommandx\Hypothesis[2][1=,2=]{
\ifthenelse{\isempty{#1}}{
\mathcal{H}
}{
\ifthenelse{\isempty{#2}}{
\mathcal{H}_{#1}
}{
\mathcal{H}^{(#2)}_{#1}
}
}
}
\newcommandx\dpartial[4][1=,2=,3=,4=\partial]{
\ifthenelse{\isempty{#3}}{
\frac{#4 #1}{#4 #2}
}{
\left.\frac{#4 #1}{#4 #2}\right\rvert_{#3}
}
}
\newcommandx\dTpartial[3][1=,2=,3=]{\dpartial[#1][#2][#3][d]}
\newcommandx\ddpartial[3][1=,2=,3=]{
\ifthenelse{\isempty{#3}}{
\frac{\partial^{2} #1}{\partial #2^2}
}{
\frac{\partial^2 #1}{\partial #2\partial #3}
}
}
\newcommand\Real{\mathbb{R}}
\newcommand\Rational{\mathbb{Q}}
\newcommand\Natural{\mathbb{N}}
\newcommand\trans[1]{{#1}^\intercal}%\newcommand\trans[1]{{\vphantom{#1}}^\top{#1}}
\newcommand{\independent}{\mathrel{\text{\scalebox{1.5}{$\perp\mkern-10mu\perp$}}}}
\newcommand\half{\frac{1}{2}}
\newcommand\normMax[1]{\left|\left|#1\right|\right|_{max}}
\newcommand\normTwo[1]{\left|\left|#1\right|\right|_{2}}
\author{Brice Ozenne}
\date{\today}
\title{Choice of the estimand in presence of intercurrent events}
\hypersetup{
 colorlinks=true,
 pdfauthor={Brice Ozenne},
 pdftitle={Choice of the estimand in presence of intercurrent events},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)},
 pdflang={English}
 }
\begin{document}

\maketitle
\section{Setting}
\label{sec:org0d93acc}

\begin{minipage}{0.5\linewidth}
\noindent Random variables:
\begin{itemize}
\item \(A\) treatment (active/control)
\item \(L\) common cause of depression and cognition, e.g. gene, stroke.
\item \(M\) depression status (yes/no)
\item \(Y\) cognitive score
\end{itemize}
\end{minipage}
\begin{minipage}{0.45\linewidth}

\noindent Working DAG \newline (directed acyclic graph)
\begin{tikzcd}[ampersand replacement=\&, column sep=normal]
\substack{\text{\Large $A$}   \\ \text{treatment}}  \ar[rr, bend left, thick] \ar[r, thick] \& \substack{\text{\Large $M$}  \\ \text{Depression}} \ar[r, thick]  \&  \substack{\text{\Large $Y$}  \\ \text{Cognition}}\\
                                              \& \substack{\text{\Large $L$} \\ \text{Stroke}}  \ar[u, thick] \ar[ur, thick]    \&                                                     
\end{tikzcd}
\end{minipage}
\section{Potential outcome notation}
\label{sec:orgf3ed6bf}
\begin{itemize}
\item \(Y^{a=1}\) cognitive score for a subject from the study population had she received the active treatment
\item \(Y^{a=0}\) cognitive score for a subject from the study population had she received the control treatment
\end{itemize}

\noindent The cognitive score had a subject from the active group received the
active treatment is the observed cognitive score:
\(Y|A\hspace{-1mm}=\hspace{-1.2mm}1 \; = \; Y^{a=1}\). Similarly in the control group.

\begin{itemize}
\item \(Y^{a=1,m=0}\) cognitive score for a subject from the study population had she received the active treatment and not experienced depression
\item \(Y^{a=1}\mid M^{a=1}=1\) cognitive score for a subject from a
subset of the study population, composed of those who would have
experienced depression had they received the active treatment, had
she received the active treatment.
\end{itemize}

\clearpage
\section{Estimands}
\label{sec:org3a69c3a}

\begin{mdframed}
\noindent \textbf{Among depressed strategy}: compare, among those who are observed to
 experience depression, the expected cognitive score between the
 active and control group.
\begin{description}
\item[{\ValidV}] Well defined sub-populations
\item[{\Warning}] prone to selection bias since a different subset of
patients is used in each treatment arm, e.g., if the treatment is
protective more frail people will be in the control group (as the
corresponding patients in the active group did not experienced
depression thanks to the treatment), leading to an unfair comparison
w.r.t. cognition.
\item Formally: \(\Psi_{\text{on}} = \Esp[Y^{a=1}|M^{a=1}=1]-\Esp[Y^{a=0}|M^{a=0}=1]\)
\item A variant of this strategy compare the cognition score at end of
follow-up or start of depression, which-ever comes first. This is
not recommended as it mixes early and late direct effect in a
proportion related to the indirect effect.
\end{description}
\end{mdframed}

\bigskip

\begin{mdframed}
\noindent \textbf{Principal stratum strategy}: similar to among depressed but
uses the same subset in each treatment arm to avoid selection
bias. There are several principal stratum that can be used:
\begin{itemize}
\item \(\Psi_{\text{always}} =
  \Esp[Y^{a=1}|M^{a=1}=M^{a=0}=1]-\Esp[Y^{a=0}|M^{a=1}=M^{a=0}=1]\):
comparing cognition among subjects that would have experienced
depression regardless to the treatment. \newline \ValidV Corresponds
to a direct treatment effect on cognition. \newline \Warning
Hypothetical sub-population that requires additional statistical
assumptions to be identified.

\item \(\Psi_{\text{always if active}} =
  \Esp[Y^{a=1}|M^{a=1}=1]-\Esp[Y^{a=0}|M^{a=1}=1]\): comparing
cognition among subjects that would have experienced depression
under the active treatment. \newline \ValidV Well defined sub-population
(depressed patients in the active group) \newline \Warning Mixes
direct and indirect treatment effect since the control treatment may
affects cognition through depression. \newline A similar estimand
can be defined under the control treatment.
\end{itemize}

\begin{align*}
& \Esp[Y^{a=1}|M^{a=1}=1]-\Esp[Y^{a=0}|M^{a=1}=1] = \Esp[Y^{1,M(1)}|M(1)=1]-\Esp[Y^{0,M(0)}|M(1)=1] \\
&= \Esp[Y^{1,M(1)}|M(1)=1]-\Esp[Y^{0,M(1)}|M(1)=1]+\Esp[Y^{0,M(1)}|M(1)=1]-\Esp[Y^{0,M(0)}|M(1)=1] \\
&= \underbrace{\Esp[Y^{1,1}|M(1)=1]-\Esp[Y^{0,1}|M(1)=1]}_{\text{direct effect}}+\underbrace{\Esp[Y^{0,1}|M(1)=1]-\Esp[Y^{0,M(0)}|M(1)=1]}_{\text{indirect effect (non-0 when M(0) \(\neq\) M(1))}}
\end{align*}
\end{mdframed}

\clearpage

\begin{mdframed}
\noindent \textbf{Hypothetical strategy}: comparing the cognition in the
entire study population, active vs. control, had all patients
experienced depression.
\begin{description}
\item[{\ValidV}] Well defined population
\item[{\Warning}] Rely on modeling assumptions, e.g., the average
cognition of those who did not experience depression had they had
experienced depression is the same as those who did experience
depression and belong to the same treatment group/covariates.
\item Formally: \(\Psi_{\text{hypo}} = \Esp[Y^{a=1,m=1}]-\Esp[Y^{a=0,m=1}]\)
\end{description}
\end{mdframed}

\begin{mdframed}
\noindent \textbf{Mediation strategy}: comparing the cognition in the entire
study population, active vs. control, had patients experienced
depression as if they had all received the active treatment (natural
direct effect).
\begin{itemize}
\item Formally: \(\Psi_{\text{NDE}} = \Esp[Y^{a=1,m=M(1)}]-\Esp[Y^{a=0,m=M(1)}]\)
\item[{\ValidV}] Well defined population
\item[{\Warning}] Also rely on modeling assumptions.
\end{itemize}
\end{mdframed}
\end{document}
